bolknote/MK61S_MINI/tests/m61_text_self_test.cpp
ContextBuffer* owned_context_buffer(ContextBufferOwner owner) {
  return (u8) owner != 0 && context_buffer_owner == owner
      ? &context_buffer : nullptr;
}

bool release_context_buffer(ContextBufferOwner owner) {
  if((u8) owner == 0 || context_buffer_owner != owner) return false;
  context_buffer_owner = (ContextBufferOwner) 0;
  return true;
}

bool save_context(ContextBuffer& out) {
  std::memset(out.bytes, 0xA5, sizeof(out.bytes));
  saved_context_angle = host_angle_unit;
  context_saves++;
  return true;
}

bool restore_context(const ContextBuffer& saved) {
  assert(saved.bytes[0] == 0xA5);
  host_angle_unit = saved_context_angle;
  context_restores++;
  return true;
}

} // пространство имён core_61

void MK61Emu_SetAngleUnit(AngleUnit angle) {
  host_angle_unit = angle;
}

AngleUnit MK61Emu_GetAngleUnit(void) {
  return host_angle_unit;
}

void hidden_start_loaded_program(void) {
  m_IK1302.comma = core_61::COMMA_RUN_POSITION;
}

void MK61Emu_ClearCodePage(void) {
  clear_count++;
  std::memset(loaded_program,0,sizeof(loaded_program));
}

void reinit_mk61_calculator_state(void) {
  reinit_count++;
  std::memset(loaded_program,0,sizeof(loaded_program));
  m_IK1302.comma = 0;
}

u32 m61_text_host_millis(void) {
  return fake_millis;
}

i32 program_store_text_font_begin(void) {
  font_begin_count++;
  if(font_session_active) return -3;
  font_session_active = true;
  return 1;
}

i32 program_store_text_font_load_from(const char* name,
                                      u16 preferred_directory) {
  if(!font_session_active || name == nullptr || name[0] == 0) return -3;
  font_attempts.push_back({name, preferred_directory});
  for(const HostFontRule& rule : font_rules) {
    if(rule.name == name && rule.directory == preferred_directory) {
      return rule.result;
    }
  }
  return 0;
}

i32 program_store_text_font_restore(void) {
  if(!font_session_active) return -3;
  font_restore_count++;
  return 1;
}

i32 program_store_text_font_end(void) {
  if(!font_session_active) return -3;
  font_restore_count++;
  font_end_count++;
  font_session_active = false;
  return 1;
}

bool OpenStoredFile(const char* name) {
  return m61_text::open_program(name);
}

u8 m61_text_host_open_file(const char* name) {
  if(stop_nested_open && std::strcmp(name, "STOPPED") == 0) return 1;
  if(std::strcmp(name, "UNAVAILABLE") == 0) return 2;
  return OpenStoredFile(name) ? 0 : 2;
}

void lcd_std_display_redraw(void) {
  calculator_redraw_count++;
}

namespace terminal_script {

void reset(void) {}

terminal_protocol::Result execute(const char* line, bool trap_mode) {
  executed_commands++;
  executed_lines.emplace_back(line);
  executed_in_trap.push_back(trap_mode);
  if(std::strcmp(line, "print on") == 0) {
    m61_text::release_display();
    return terminal_protocol::Result::ok();
  }
  if(std::strncmp(line, "print ", 6) == 0) {
    m61_text::claim_display();
    return terminal_protocol::Result::ok();
  }
  if(std::strcmp(line, "wait 500") == 0) {
    return terminal_protocol::Result::wait(500);
  }
  if(std::strcmp(line, "bad") == 0) return terminal_protocol::Result::error();
  if(std::strncmp(line,"load ",5)==0) {
    program_load::Request request={};
    if(program_load::parse(line+5,request)!=program_load::Syntax::LEGACY)
      return terminal_protocol::Result::action(terminal_protocol::ResultKind::LOAD_BINARY,line+5);
  }
  if(std::strcmp(line, "run") == 0) return terminal_protocol::Result::action(terminal_protocol::ResultKind::RUN_PROGRAM, "");
  if(std::strncmp(line, "run :", 5) == 0) {
    return terminal_protocol::Result::action(terminal_protocol::ResultKind::GOTO_LABEL, line + 5);
  }
  if(std::strncmp(line, "open ", 5) == 0) {
    return terminal_protocol::Result::action(terminal_protocol::ResultKind::OPEN_FILE, line + 5);
  }
  if(std::strcmp(line, "ret") == 0) {
    return terminal_protocol::Result::action(
        terminal_protocol::ResultKind::RETURN_SCRIPT, "");
  }
  if(std::strcmp(line, "reinit") == 0) {
    return terminal_protocol::Result::action(
        terminal_protocol::ResultKind::REINIT_CALCULATOR, "");
  }
  return terminal_protocol::Result::ok();
}

} // пространство имён terminal_script

static void reset_host(void) {
  m61_text::cancel();
  program_load::reset();
  assert((u8) core_61::context_buffer_owner == 0);
  scripts.clear();
  range_reads = 0;
  executed_commands = 0;
  clear_count = 0;
  active_program_steps = core_61::CLASSIC_PROGRAM_STEP;
  boundary_hook = nullptr;
  boundary_user_data = nullptr;
  command_hooks.clear();
  next_command_hook = 1;
  command_sequence = 0;
  context_saves = 0;
  context_restores = 0;
  reinit_count = 0;
  host_angle_unit = DEGREE;
  saved_context_angle = DEGREE;
  fake_millis = 0;
  executed_lines.clear();
  executed_in_trap.clear();
  font_rules.clear();
  font_attempts.clear();
  font_session_active = false;
  font_begin_count = 0;
  font_restore_count = 0;
  font_end_count = 0;
  stop_nested_open = false;
  calculator_redraw_count = 0;
  m_IK1302.comma = 0;
}

static void add_script(
    const char* name, const std::string& source,
    u16 parent_id = program_store::ROOT_ID);

static void test_nested_interpreter_esc_cancels_scenario_silently(void) {
  reset_host();
  font_rules.push_back({"HighNoon", program_store::ROOT_ID, 1});
  stop_nested_open = true;
  add_script("GAME",
             "loadfont HighNoon\n"
             "open STOPPED\n"
             "bad\n");

  assert(m61_text::load_program("GAME"));
  assert(!m61_text::active());
  assert(!font_session_active);
  assert(font_begin_count == 1);
  assert(font_end_count == 1);
  assert(font_restore_count == 1);
  assert(calculator_redraw_count == 1);
  assert(executed_lines.size() == 1);
  assert(executed_lines[0] == "open STOPPED");
  m61_text::Error error = {};
  assert(!m61_text::last_error(error));
}

static void test_optional_open_skips_missing_content_but_keeps_strict_open(void) {
  reset_host();
  add_script("OPTIONAL", "open? UNAVAILABLE\nok\nret\n");
  assert(m61_text::load_program("OPTIONAL"));
  assert(!m61_text::active());
  m61_text::Error error = {};
  assert(!m61_text::last_error(error));
  assert(executed_lines.size() == 2);
  assert(executed_lines[0] == "ok");
  assert(executed_lines[1] == "ret");

  reset_host();
  add_script("STRICT", "open UNAVAILABLE\nok\n");
  assert(!m61_text::load_program("STRICT"));
  assert(m61_text::last_error(error));
  assert(error.line == 1);
  assert(std::strcmp(error.message, "cannot open referenced file") == 0);

  reset_host();
  add_script("INVALID", "open?\nok\n");
  assert(!m61_text::load_program("INVALID"));
  assert(m61_text::last_error(error));
  assert(error.line == 1);
  assert(std::strcmp(error.message, "optional open needs a path") == 0);

  reset_host();
  add_script("TRAPOPTIONAL",
             "trap 10 run :handler\n"
             "run\n"
             "ret\n"
             ":handler\n"
             "open? UNAVAILABLE\n"
             "ret\n");
  assert(m61_text::load_program("TRAPOPTIONAL"));
  assert(boundary_hook != nullptr);
  const core_61::Mk61ProgramBoundaryContext boundary = {10, 0};
  assert(boundary_hook(boundary, boundary_user_data));
  m61_text::service();
  assert(m61_text::last_error(error));
  assert(error.line == 5);
  assert(std::strcmp(error.message,
                     "open? is not allowed in a trap handler") == 0);
}

static void add_script(const char* name, const std::string& source,
                       u16 parent_id) {
  scripts.push_back({name, source, parent_id});
}

static m61_text::Error require_error(void) {
  m61_text::Error error = {};
  assert(m61_text::last_error(error));
  return error;
}

static bool fire_program_boundary(u8 address, u8 opcode = 0) {
  assert(boundary_hook != nullptr);
  const core_61::Mk61ProgramBoundaryContext context = {address, opcode};
  return boundary_hook(context, boundary_user_data);
}

static u8 fire_mk61_command(
    u8 opcode,
    core_61::Mk61CommandSource source =
        core_61::Mk61CommandSource::KEYBOARD) {
  command_sequence++;
  core_61::Mk61CommandHookContext before = {
    core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
    source,
    opcode,
    opcode,
    command_sequence
  };
  for(HostCommandHook& hook : command_hooks) {
    if(hook.opcode == opcode &&
       hook.phase == core_61::Mk61CommandHookPhase::BEFORE_EXECUTE) {
      hook.callback(before, hook.user_data);
    }
  }

