bolknote/MK61S_MINI/tests/m61_text_self_test.cpp
  m_IK1302.comma = 0;
  m61_text::service();
  assert(m61_text::active());
  assert(!m61_text::display_owned());

  m_IK1302.comma = 0;
  m61_text::service();
  assert(!m61_text::active());
  assert(!m61_text::display_owned());
}

static void test_trap_wait_holds_snapshot_and_resumes_at_deadline(void) {
  reset_host();
  add_script("WAIT", "trap 10 run :frame\nrun\nret\n:frame\nprint \"frame\"\nwait 500\nret\n");
  assert(m61_text::load_program("WAIT"));
  assert(fire_program_boundary(10, 0x02));

  m61_text::service();
  assert(m61_text::calculator_suspended());
  assert(m61_text::display_owned());
  assert(context_saves == 1);
  assert(context_restores == 0);

  fake_millis = 499;
  m61_text::service();
  assert(m61_text::calculator_suspended());
  assert(context_restores == 0);

  fake_millis = 500;
  m61_text::service();
  assert(!m61_text::calculator_suspended());
  assert(context_restores == 1);
  assert(m61_text::active());
  m61_text::cancel();
}

static void test_trap_ret_preserves_user_angle_change(void) {
  reset_host();
  add_script("ANGLE",
             "trap 10 run :frame\n"
             "run\n"
             "ret\n"
             ":frame\n"
             "wait 500\n"
             "ret\n");
  MK61Emu_SetAngleUnit(DEGREE);
  assert(m61_text::load_program("ANGLE"));
  assert(fire_program_boundary(10));

  m61_text::service();
  assert(m61_text::calculator_suspended());
  assert(MK61Emu_GetAngleUnit() == DEGREE);

  // Имитируем Р, нажатую на физической клавиатуре во время показа кадра.
  MK61Emu_SetAngleUnit(RADIAN);
  fake_millis = 500;
  m61_text::service();

  assert(!m61_text::calculator_suspended());
  assert(context_restores == 1);
  assert(MK61Emu_GetAngleUnit() == RADIAN);
  m61_text::cancel();
}

static void test_trap_handler_can_call_a_common_label(void) {
  reset_host();
  add_script("CALL",
             "trap 10 run :frame\n"
             "run\n"
             "ret\n"
             ":frame\n"
             "run :common\n"
             "print \"bee\"\n"
             "ret\n"
             ":common\n"
             "print \"ansi\"\n"
             "ret\n");
  assert(m61_text::load_program("CALL"));
  assert(fire_program_boundary(10));

  m61_text::service();
  assert(context_saves == 1 && context_restores == 1);
  assert(executed_lines.size() == 6);
  assert(executed_lines[1] == "run :common");
  assert(executed_lines[2] == "print \"ansi\"");
  assert(executed_lines[3] == "ret");
  assert(executed_lines[4] == "print \"bee\"");
  assert(executed_lines[5] == "ret");
  assert(m61_text::active());
  m61_text::cancel();
}

static void test_nested_script_returns_to_parent_and_depth_is_bounded(void) {
  reset_host();
  add_script("PARENT", "open CHILD\nbad\n");
  add_script("CHILD", "ok\n");
  assert(m61_text::load_program("PARENT"));
  assert(m61_text::active());
  m61_text::service();
  const m61_text::Error error = require_error();
  assert(std::strcmp(error.script, "PARENT") == 0);
  assert(error.line == 2);

  reset_host();
  add_script("RECURSE", "open RECURSE\n");
  assert(m61_text::load_program("RECURSE"));
  assert(m61_text::active());
  m61_text::service();
  const m61_text::Error depth_error = require_error();
  assert(std::strcmp(depth_error.script, "RECURSE") == 0);
  assert(depth_error.line == 1);
  assert(!m61_text::active());
}

static void test_explicit_id_disambiguates_directory_names(void) {
  reset_host();
  add_script("SAME", "bad\n", 10);
  add_script("SAME", "ok\n", 20);
  assert(m61_text::load_program((u16) 1));
  assert(executed_commands == 1);
  assert(!m61_text::active());
  m61_text::Error error = {};
  assert(!m61_text::last_error(error));
}

static void test_trap_saves_runs_and_restores_at_exact_address(void) {
  reset_host();
  add_script(
      "TRAP",
      "trap 10 run :message\n"
      "run\n"
      "ret\n"
      ":message\n"
      "print \"AT 10: X={X}\\r\\n\"\n"
      "ret\n");

  assert(m61_text::load_program("TRAP"));
  assert(m61_text::active());
  assert(m_IK1302.comma == core_61::COMMA_RUN_POSITION);
  assert(!fire_program_boundary(9, 0x01));
  assert(fire_program_boundary(10, 0x02));
  assert(m61_text::calculator_suspended());

  m61_text::service();
  assert(context_saves == 1);
  assert(context_restores == 1);
  assert(!m61_text::calculator_suspended());
  assert(executed_lines.size() == 3);
  assert(executed_lines[0] == "run");
  assert(executed_lines[1].rfind("print ", 0) == 0);
  assert(executed_lines[2] == "ret");
  assert(!executed_in_trap[0]);
  assert(executed_in_trap[1] && executed_in_trap[2]);

  // Восстановление точного контекста до команды снова встречает адрес 10.
  // Первая встреча — однократное продолжение; последующий цикл может снова
  // попасть в ловушку.
  assert(!fire_program_boundary(10, 0x02));
  assert(fire_program_boundary(10, 0x02));
  m61_text::service();
  assert(context_saves == 2 && context_restores == 2);
  assert(!fire_program_boundary(10, 0x02));

  m_IK1302.comma = 0;
  m61_text::service();
  assert(m61_text::active());
  assert(boundary_hook != nullptr);

  // После ручного В/О → С/П наблюдатель остаётся привязан к программе.
  m_IK1302.comma = core_61::COMMA_RUN_POSITION;
  assert(fire_program_boundary(10, 0x02));
  m61_text::service();
  assert(context_saves == 3 && context_restores == 3);
  assert(m61_text::active());
  m61_text::Error error = {};
  assert(!m61_text::last_error(error));
  m61_text::cancel();
}

static void test_trap_is_activated_only_when_its_line_executes(void) {
  reset_host();
  add_script(
      "LATE",
      "run\n"
      "trap 10 run :message\n"
      "run\n"
      "ret\n"
      ":message\n"
      "ret\n");
  assert(m61_text::load_program("LATE"));
  assert(!fire_program_boundary(10));

  m_IK1302.comma = 0;
  m61_text::service();
  assert(m_IK1302.comma == core_61::COMMA_RUN_POSITION);
  assert(fire_program_boundary(10));
  m61_text::service();
  assert(context_saves == 1 && context_restores == 1);
  assert(!fire_program_boundary(10));
  m_IK1302.comma = 0;
  m61_text::service();
  assert(m61_text::active());
  m61_text::cancel();
}

static void test_restarting_same_root_preserves_active_traps(void) {
  reset_host();
  add_script(
      "RESTART",
      "run\n"
      "trap 10 run :message\n"
      "ret\n"
      ":message\n"
      "ret\n");

  // Первый запуск доходит до `run` раньше объявления и пока не перехватывает
  // адрес. После останова строка trap исполняется, а корневой ret оставляет
  // наблюдатель активным.
  assert(m61_text::load_program("RESTART"));
  assert(!fire_program_boundary(10));
  m_IK1302.comma = 0;
  m61_text::service();
  assert(m61_text::active());

