bolknote/MK61S_MINI/tests/m61_text_self_test.cpp
static void test_reinit_continues_script_and_clears_handlers(void) {
  reset_host();
  add_script(
      "REINIT",
      "bind AE run :pressed\n"
      "trap 10 run :trapped\n"
      "reinit\n"
      "ok\n"
      "ret\n"
      ":pressed\n"
      "ret\n"
      ":trapped\n"
      "ret\n");
  assert(m61_text::load_program("REINIT"));
  assert(reinit_count == 1);
  assert(!m61_text::active());
  assert(core_61::registered_mk61_command_hook_count() == 0);
  assert(executed_lines.size() == 3);
  assert(executed_lines[0] == "reinit");
  assert(executed_lines[1] == "ok");
  assert(executed_lines[2] == "ret");
}

static void test_manual_clear_stops_bind_and_trap_watcher(void) {
  reset_host();
  add_script(
      "CLEAR",
      "bind AE run :pressed\n"
      "trap 10 run :trapped\n"
      "ret\n"
      ":pressed\n"
      "ret\n"
      ":trapped\n"
      "ret\n");
  assert(m61_text::load_program("CLEAR"));
  assert(m61_text::active());
  assert(boundary_hook != nullptr);
  assert(core_61::registered_mk61_command_hook_count() == 2);

  assert(m61_text::clear_bindings_and_traps());
  assert(!m61_text::active());
  assert(!m61_text::calculator_suspended());
  assert(boundary_hook == nullptr);
  assert(core_61::registered_mk61_command_hook_count() == 0);
  assert(fire_mk61_command(0xAE) == 0xAE);
  assert(!m61_text::clear_bindings_and_traps());
}

static void test_bind_and_trap_survive_program_stop(void) {
  reset_host();
  add_script(
      "PERSIST",
      "bind AE run :pressed\n"
      "trap 10 run :trapped\n"
      "run\n"
      "ret\n"
      ":pressed\n"
      "ret\n"
      ":trapped\n"
      "ret\n");
  assert(m61_text::load_program("PERSIST"));
  assert(m61_text::active());
  assert(m_IK1302.comma == core_61::COMMA_RUN_POSITION);
  assert(core_61::registered_mk61_command_hook_count() == 2);

  // Штатный останов программы только продолжает сценарий до корневого ret.
  // Активные обработчики переводят его в WATCH_EVENTS, а не очищаются.
  m_IK1302.comma = 0;
  m61_text::service();
  assert(m61_text::active());
  assert(boundary_hook != nullptr);
  assert(core_61::registered_mk61_command_hook_count() == 2);

  assert(fire_mk61_command(0xAE) == (u8) MK61_NOP);
  m61_text::service();
  assert(m61_text::active());

  m_IK1302.comma = core_61::COMMA_RUN_POSITION;
  assert(fire_program_boundary(10));
  m61_text::service();
  assert(context_saves == 1 && context_restores == 1);
  assert(m61_text::active());
  m61_text::cancel();
}

static void test_manual_clear_preserves_running_script(void) {
  reset_host();
  add_script(
      "CONTINUE",
      "bind AE run :pressed\n"
      "trap 10 run :trapped\n"
      "wait 500\n"
      "ok\n"
      "ret\n"
      ":pressed\n"
      "ret\n"
      ":trapped\n"
      "ret\n");
  assert(m61_text::load_program("CONTINUE"));
  assert(m61_text::active());
  assert(core_61::registered_mk61_command_hook_count() == 2);

  assert(m61_text::clear_bindings_and_traps());
  assert(m61_text::active());
  assert(core_61::registered_mk61_command_hook_count() == 0);
  assert(!fire_program_boundary(10));

  fake_millis = 500;
  m61_text::service();
  assert(!m61_text::active());
  assert(boundary_hook == nullptr);
  assert(executed_lines.back() == "ret");
}

static void test_manual_clear_inside_trap_restores_context(void) {
  reset_host();
  add_script(
      "TRAPCLEAR",
      "trap 10 run :trapped\n"
      "ret\n"
      ":trapped\n"
      "wait 500\n"
      "ret\n");
  assert(m61_text::load_program("TRAPCLEAR"));
  m_IK1302.comma = core_61::COMMA_RUN_POSITION;
  assert(fire_program_boundary(10));
  m61_text::service();
  assert(m61_text::calculator_suspended());
  assert(context_saves == 1);

  assert(m61_text::clear_bindings_and_traps());
  assert(m61_text::calculator_suspended());
  fake_millis = 500;
  m61_text::service();
  assert(context_restores == 1);
  assert(!m61_text::calculator_suspended());
  assert(!m61_text::active());
  assert(boundary_hook == nullptr);
}

static void test_ret_returns_from_nested_script_and_ends_root(void) {
  reset_host();
  add_script("PARENT", "open CHILD\nbad\n");
  add_script("CHILD", "ret\nbad\n");
  assert(!m61_text::load_program("PARENT"));
  const m61_text::Error error = require_error();
  assert(std::strcmp(error.script, "PARENT") == 0);
  assert(error.line == 2);

  reset_host();
  add_script("ROOTRET", "ret\nbad\n");
  assert(m61_text::load_program("ROOTRET"));
  assert(!m61_text::active());
  assert(executed_commands == 1);
  m61_text::Error no_error = {};
  assert(!m61_text::last_error(no_error));
}

static void test_nested_open_preserves_program_and_root_still_clears(void) {
  reset_host();
  add_script("ROOT", "open FIRST\nopen SECOND\nret\n");
  add_script("FIRST", "ok\n");
  add_script("SECOND", "open LEAF\nret\n");
  add_script("LEAF", "ok\n");
  assert(m61_text::load_program("ROOT"));
  for(int i=0; i<10 && m61_text::active(); ++i) m61_text::service();
  assert(!m61_text::active());
  m61_text::Error error={};
  assert(!m61_text::last_error(error));
  // Three nested calls must not erase their caller's loaded program.
  assert(clear_count==1);
  assert(m61_text::open_program((u16) 1));
  assert(!m61_text::active());
  assert(clear_count==2); // A fresh launch still starts with empty memory.
}

static std::vector<u16> binary_directories;
bool load_binary_program(u16 directory, const char* args) {
  binary_directories.push_back(directory);
  program_load::Request request={};
  if(program_load::parse(args,request)!=program_load::Syntax::BINARY)
    return program_load::reject("Invalid binary load syntax");
  for(usize i=0;i<scripts.size();++i)
    if(scripts[i].parent_id==directory && scripts[i].name==request.path)
      return program_load::load(i,request.address,10000);
  return program_load::reject("Cannot open binary program");
}

static void test_binary_load_uses_script_directory_and_reports_failure() {
  const u8 expected[]={1,2,3,4,5,1,2,3,4,5,0x50};
  // Independent desktop optimal ZX0 fixture, with little-endian CRC32.
  const u8 encoded[]={0xcf,0x81,0x3f,0xf3,0x1e,0x01,0x02,0x03,0x04,0x05,0xf6,0x2d,0x50,0x55,0x56};
  const std::string binary(reinterpret_cast<const char*>(encoded),sizeof(encoded));
  reset_host(); binary_directories.clear();
  add_script("ROOT","load 0109 payload.bin\nopen CHILD\nload 0500 payload.bin\nret\n",17);
  add_script("CHILD","load 0224 payload.bin\nret\n",88);
  scripts.push_back({"payload.bin",binary,17,program_store::ProgramType::MK61_BINARY});
  scripts.push_back({"payload.bin",binary,88,program_store::ProgramType::MK61_BINARY});
  assert(m61_text::load_program("ROOT"));
  for(int i=0;i<20 && m61_text::active();++i) m61_text::service();
  assert(!m61_text::active() && !program_load::blocked());
  for(unsigned address:{109,224,500})
    assert(std::memcmp(loaded_program+address,expected,sizeof(expected))==0);
  assert(clear_count==1 && loaded_program[108]==0 && loaded_program[520]==0);
  assert((binary_directories==std::vector<u16>{17,88,17}));
  m61_text::Error error;
  assert(!m61_text::last_error(error));

