bolknote/MK61S_MINI/tests/m61_text_self_test.cpp
  for(unsigned mode=0;mode<4;++mode) {
    reset_host();
    std::string bad=binary;
    if(mode==0) bad[0]^=1;
    if(mode==1) bad.pop_back();
    if(mode==2) bad.push_back(0);
    add_script("BAD","ok\nload 0000 payload.bin\nrun\n");
    if(mode!=3) scripts.push_back({"payload.bin",bad,program_store::ROOT_ID,program_store::ProgramType::MK61_BINARY});
    assert(!m61_text::load_program("BAD"));
    assert(m61_text::last_error(error) && error.line==2);
    assert(!core_61::is_RUN());
    assert(executed_lines.back()=="load 0000 payload.bin");
    if(mode==0) assert(std::strstr(error.message,"CRC32"));
    if(mode<3) assert(program_load::blocked());
    // A fresh root resets the failed load along with the calculator memory.
    add_script("FRESH","ret\n");
    assert(m61_text::load_program("FRESH") && !program_load::blocked());
  }
  reset_host();
  add_script("REINIT","reinit\nload 0000 payload.bin\nret\n");
  scripts.push_back({"payload.bin",binary,program_store::ROOT_ID,program_store::ProgramType::MK61_BINARY});
  assert(m61_text::load_program("REINIT") && !program_load::blocked());
  assert(reinit_count==1 && std::memcmp(loaded_program,expected,sizeof(expected))==0);
}

int main(void) {
  test_binary_load_uses_script_directory_and_reports_failure();
  test_nested_open_preserves_program_and_root_still_clears();
  test_nested_interpreter_esc_cancels_scenario_silently();
  test_optional_open_skips_missing_content_but_keeps_strict_open();
  test_loadfont_is_m61_scoped_and_uses_script_directory();
  test_loadfont_default_and_all_exit_paths_restore();
  test_loadfont_failures_are_reported_by_m61();
  test_command_failure_reports_script_and_line();
  test_long_missing_name_is_truncated_to_error_capacity();
  test_duplicate_and_oversized_labels_fail_before_execution();
  test_line_limit_is_enforced_during_indexing();
  test_indexed_loop_is_budgeted_and_uses_block_reads();
  test_label_reference_rejects_trailing_tokens();
  test_run_waits_and_reports_later_failure();
  test_print_owns_display_until_root_script_finishes();
  test_print_off_and_on_control_display_ownership();
  test_trap_wait_holds_snapshot_and_resumes_at_deadline();
  test_trap_ret_preserves_user_angle_change();
  test_trap_handler_can_call_a_common_label();
  test_nested_script_returns_to_parent_and_depth_is_bounded();
  test_explicit_id_disambiguates_directory_names();
  test_trap_saves_runs_and_restores_at_exact_address();
  test_trap_is_activated_only_when_its_line_executes();
  test_restarting_same_root_preserves_active_traps();
  test_invalid_traps_fail_before_or_at_run();
  test_trap_handler_requires_ret_and_restores_on_error();
  test_bind_consumes_keyboard_opcode_and_calls_handler();
  test_bind_is_validated_and_activated_only_when_executed();
  test_bind_handler_requires_ret();
  test_bind_limit_and_non_reentrant_handler();
  test_reinit_continues_script_and_clears_handlers();
  test_manual_clear_stops_bind_and_trap_watcher();
  test_bind_and_trap_survive_program_stop();
  test_manual_clear_preserves_running_script();
  test_manual_clear_inside_trap_restores_context();
  test_ret_returns_from_nested_script_and_ends_root();
  std::printf("m61_text_self_test: ok\n");
  return 0;
}
